Охотники_и_рыболовы/src/InformationRegisters/ОхотничьиБилеты/ОхотничьиБилеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОхотничьиБилеты</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Серия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗарегистрированВ</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
      <types>CatalogRef.ОрганыВыдачиГосБилетов</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>КемВыдан</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаЛишения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияЛишения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Причина</name>
    <type>
      <types>EnumRef.ПричиныНедействительностиБилета</types>
    </type>
  </attributes>
  <dimensions>
    <name>Охотник</name>
    <type>
      <types>CatalogRef.Охотники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидБилета</name>
    <type>
      <types>EnumRef.ВидыОхотничьихБилетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Действует</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Лишен</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Исключен</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Охотники_и_рыболовы/src/Enums/ВидыОхотничьихБилетов/ВидыОхотничьихБилетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОхотничьихБилетов</name>
  <enumValues>
    <name>ГосБилет</name>
    <comment>Охотничий билет Российской Федерации</comment>
  </enumValues>
  <enumValues>
    <name>ЧленскийБилет</name>
    <comment>Членский охотничье-рыболовный билет</comment>
  </enumValues>
</mdclass:Enum>

Охотники_и_рыболовы/src/Enums/ПричиныНедействительностиБилета/ПричиныНедействительностиБилета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПричиныНедействительностиБилета</name>
  <enumValues>
    <name>Утеря</name>
  </enumValues>
  <enumValues>
    <name>Просрочен</name>
  </enumValues>
  <enumValues>
    <name>НеУказан</name>
  </enumValues>
  <enumValues>
    <name>Перерегистрация</name>
  </enumValues>
  <enumValues>
    <name>ЛишенПраваОхоты</name>
  </enumValues>
  <enumValues>
    <name>ИсключенИзСистемыККОООР</name>
  </enumValues>
  <enumValues>
    <name>НеправильноеЗаполнение</name>
  </enumValues>
  <enumValues>
    <name>ЗаменаБилета</name>
  </enumValues>
</mdclass:Enum>

Охотники_и_рыболовы/src/InformationRegisters/ОхотничьиБилеты/Forms/ФормаЗаписи/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОсновнаяОрганизация = ОхотаСерверПовтИсп.ПолучитьНастройкуПользователя(ПредопределенноеЗначение("ПланВидовХарактеристик.НастройкиПользователей.ОсновнаяОрганизация"));
	
	Охотхозяйство = Запись.Охотник.Охотхозяйство;
	Запись.Дата = ТекущаяДата();

	Если Охотхозяйство.Пустая() Тогда
		ЭтоГосБилет = Запись.ВидБилета = ПредопределенноеЗначение("Перечисление.ВидыОхотничьихБилетов.ГосБилет");
		Возврат;
	КонецЕсли;
	
	Если Запись.ВидБилета = ПредопределенноеЗначение("Перечисление.ВидыОхотничьихБилетов.ЧленскийБилет") Тогда
		Элементы.ЗарегистрированВ.СписокВыбора.Добавить(Охотхозяйство,Охотхозяйство.Наименование);
		Элементы.ЗарегистрированВ.РежимВыбораИзСписка = Истина;
		
		//ОснОрганизация = ПредопределенноеЗначение("ПланВидовХарактеристик.НастройкиПользователей.ОсновнаяОрганизация");
		//Запись.КемВыдан = ОхотаСерверПовтИсп.ПолучитьНастройкуПользователя(ОснОрганизация);
		//Запись.ЗарегистрированВ = ОхотаСерверПовтИсп.ПолучитьНастройкуПользователя(ОснОрганизация);
		
	Если Запись.Охотник.Исключен = Истина тогда
		Запись.Исключен = Истина;
	КонецЕсли;
	

	Иначе	
		ЭтоГосБилет = Истина;
	КонецЕсли;	
	
	//УстановитьУсловноеОформление();

	
		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьЭлементов()
	Элементы.ДатаОкончанияДействия.Видимость = НЕ Запись.Действует;
	Элементы.Причина.Видимость = НЕ Запись.Действует;
	Если Запись.Действует Тогда
		Запись.ДатаОкончанияДействия = '00010101';
		Запись.Причина = Неопределено;
	Иначе
		Запись.ДатаОкончанияДействия = ТекущаяДата();
	КонецЕсли;
	
	Если Запись.ВидБилета = ПредопределенноеЗначение("Перечисление.ВидыОхотничьихБилетов.ГосБилет") Тогда
		Элементы.КемВыдан.Видимость = Ложь;
	Иначе
		Элементы.КемВыдан.Видимость = Истина;
	КонецЕсли;	
	
	Элементы.ПериодДействияЛишенияПраваОхоты.Видимость = Ложь;
	Элементы.ДатаНачалаЛишения.Видимость = Ложь;
	Элементы.ДатаОкончанияЛишения.Видимость = Ложь;

	Если  Запись.Причина = ПредопределенноеЗначение("Перечисление.ПричиныНедействительностиБилета.ЛишенПраваОхоты") 
		И Запись.ВидБилета = ПредопределенноеЗначение("Перечисление.ВидыОхотничьихБилетов.ГосБилет")Тогда	
		
		Элементы.ПериодДействияЛишенияПраваОхоты.Видимость = Истина;
		Элементы.ДатаНачалаЛишения.Видимость = Истина;
		Элементы.ДатаОкончанияЛишения.Видимость = Истина;
	Иначе 
		Элементы.ПериодДействияЛишенияПраваОхоты.Видимость = Ложь;
		Элементы.ДатаНачалаЛишения.Видимость = Ложь;
		Элементы.ДатаОкончанияЛишения.Видимость = Ложь;

	КонецЕсли;



КонецПроцедуры	

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьТипПоляКемВыдан();
	
	УстановитьВидимостьЭлементов();
	
	Если Запись.Охотник.Пустая() Тогда
		Если Запись.ВидБилета.Пустая() Тогда
			Элементы.ЗарегистрированВ.ТолькоПросмотр = Истина;
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Элементы.Охотник.ТолькоПросмотр = Истина;
	Элементы.Охотник.КнопкаОткрытия = Ложь;
	Элементы.ВидБилета.ТолькоПросмотр = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	 Запись.Дата = ТекущаяДата();
	
	Если НЕ Запись.Причина.Пустая() И Запись.Действует Тогда
		Отказ = Истина;
		Текст = "Нельзя записать действующий билет с не пустой причиной неактуальности";
		Поле = "Запись.Причина";
		ОхотаСервер.ПоказатьСообщение(Текст,Поле);
	КонецЕсли;
	
	Если  Запись.Причина = ПредопределенноеЗначение("Перечисление.ПричиныНедействительностиБилета.ИсключенИзСистемыККОООР")
		И Запись.ВидБилета = ПредопределенноеЗначение("Перечисление.ВидыОхотничьихБилетов.ГосБилет") Тогда
		Отказ = Истина;
		Текст = "Нельзя записать причину неактуальности Исключен Из Системы ККОООР для ГосБилета";
		Поле = "Запись.Причина";
		ОхотаСервер.ПоказатьСообщение(Текст,Поле);
	КонецЕсли;

	Если  Запись.Причина = ПредопределенноеЗначение("Перечисление.ПричиныНедействительностиБилета.ЛишенПраваОхоты") 
		И Запись.ВидБилета = ПредопределенноеЗначение("Перечисление.ВидыОхотничьихБилетов.ЧленскийБилет") Тогда
		Отказ = Истина;
		Текст = "Нельзя записать причину неактуальности Лишен Права Охоты для Членского Билета";
		Поле = "Запись.Причина";
		ОхотаСервер.ПоказатьСообщение(Текст,Поле);
	КонецЕсли;
	
	//Если  Запись.Причина = ПредопределенноеЗначение("Перечисление.ПричиныНедействительностиБилета.ЛишенПраваОхоты") Тогда
	//	Если Запись.ДатаНачалаЛишения. и Запись.ДатаОкончанияЛишения.Пустая()  Тогда
	//	Отказ = Истина;
	//	Текст = "Нельзя записать пустую дату для причины - лишен права охоты";
	//	Поле = "ДатаОкончанияЛишения";
	//	ОхотаСервер.ПоказатьСообщение(Текст,Поле);
	//КонецЕсли;
	//КонецЕсли;
	
	Если Запись.Охотник.Исключен и Запись.ЗарегистрированВ.ЧленствоККОООР Тогда
		Текст = "Охотник исключен из системы ККОООР.
		|Членский билет системы ККОООР зарегистрировать невозможно";
		ОхотаСервер.ПоказатьСообщение(Текст,Поле);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	Если Запись.Причина = ПредопределенноеЗначение("Перечисление.ПричиныНедействительностиБилета.ИсключенИзСистемыККОООР") 
		И НЕ Запись.ЗарегистрированВ.ЧленствоККОООР Тогда
		Текст = "Охотник зарегистрирован не в системе ККОООР";
		ОхотаСервер.ПоказатьСообщение(Текст,Поле);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	

	КонецПроцедуры

&НаКлиенте
Процедура ВидБилетаПриИзменении(Элемент)
	Если Запись.ВидБилета.Пустая() Тогда
		Элементы.ЗарегистрированВ.ТолькоПросмотр = Истина;
		Возврат;
	Иначе
		Элементы.ЗарегистрированВ.ТолькоПросмотр = Ложь;
	КонецЕсли;	
	
	УстановитьТипПоляКемВыдан();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТипПоляКемВыдан()
	Если Запись.ВидБилета = ПредопределенноеЗначение("Перечисление.ВидыОхотничьихБилетов.ГосБилет") Тогда
		Элементы.ЗарегистрированВ.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ОрганыВыдачиГосБилетов");
	Иначе	
		Элементы.ЗарегистрированВ.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Охотхозяйства");	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Если  Запись.Причина = ПредопределенноеЗначение("Перечисление.ПричиныНедействительностиБилета.ЛишенПраваОхоты")
		И Запись.ВидБилета = ПредопределенноеЗначение("Перечисление.ВидыОхотничьихБилетов.ГосБилет") Тогда
		Запись.Лишен = Истина;
	Иначе
		Запись.Лишен = Ложь;
	КонецЕсли;
	
	Если  Запись.Причина = ПредопределенноеЗначение("Перечисление.ПричиныНедействительностиБилета.ИсключенИзСистемыККОООР")
		 Тогда
		Запись.Исключен = Истина;
	Иначе
		Запись.Исключен = Ложь;
	КонецЕсли;


	ОповеститьОбИзменении(Запись.ИсходныйКлючЗаписи);
	ПараметрыОтвета = Новый Структура("Билет,Действует,ЗарегистрированВ,Серия,Номер,Лишен,Исключен",
										Запись.ВидБилета,Запись.Действует,Запись.ЗарегистрированВ,Запись.Серия,Запись.Номер,Запись.Лишен,Запись.Исключен);
	Оповестить("ИзменениеОхотничьегоБилета",ПараметрыОтвета);
	ОбновитьПовторноИспользуемыеЗначения();
	Элементы.ЗарегистрированВ.Доступность = Ложь;
	Элементы.КемВыдан.Доступность = Ложь;
	Элементы.Номер.Доступность = Ложь;
	Элементы.Серия.Доступность = Ложь;
	Элементы.ДатаВыдачи.Доступность = Ложь;

	

	
КонецПроцедуры

&НаКлиенте
Процедура ДействуетПриИзменении(Элемент)
	
	УстановитьВидимостьЭлементов();
	ПроверитьПериод();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияДействияПриИзменении(Элемент)
	Если Запись.ДатаОкончанияДействия = '00010101' Тогда
		Запись.Действует = Истина;
		Запись.Причина = Неопределено;
	Иначе
		Запись.Действует = Ложь;
		Если Запись.Причина.Пустая() Тогда
			Запись.Причина = ПредопределенноеЗначение("Перечисление.ПричиныНедействительностиБилета.Просрочен");
		КонецЕсли;	
	КонецЕсли;	
	
	ПроверитьПериод();
КонецПроцедуры

&НаКлиенте
Процедура ПричинаПриИзменении(Элемент)
	Если НЕ Запись.Причина.Пустая() Тогда
		Запись.ДатаОкончанияДействия = ТекущаяДата();
		Запись.Действует = Ложь;
	Иначе
		Запись.ДатаОкончанияДействия = '00010101';
		Запись.Действует = Истина;
	КонецЕсли;
	
	Если  Запись.Причина = ПредопределенноеЗначение("Перечисление.ПричиныНедействительностиБилета.ИсключенИзСистемыККОООР")
		 Тогда
		Запись.Исключен = Истина;
	Иначе
		Запись.Исключен = Ложь;
	КонецЕсли;
	
	
	ПроверитьПериод();
	УстановитьВидимостьЭлементов();			
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПериод()
	Если Запись.Период = '00010101' Тогда
		Запись.Период = ТекущаяДата();
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура ДатаОкончанияЛишенияПриИзменении(Элемент)
	Если Запись.Причина = ПредопределенноеЗначение("Перечисление.ПричиныНедействительностиБилета.ЛишенПраваОхоты")тогда
		Запись.ДатаНачалаЛишения = ТекущаяДата();
	КонецЕсли;		 
	ПроверитьПериод();
	УстановитьВидимостьЭлементов();			
КонецПроцедуры



//&НаКлиенте
//Процедура КемВыданПриИзменении(Элемент)
//	Если НЕ ЗначениеЗаполнено(Запись.ЗарегистрированВ) И НЕ ЭтоГосБилет Тогда
//		Если ПроверитьВыбранноеЗначениеЗарегистрирован(Запись.КемВыдан,ОсновнаяОрганизация) Тогда
//			Запись.ЗарегистрированВ = Запись.КемВыдан;
//		КонецЕсли;	
//	КонецЕсли;	
//КонецПроцедуры


//&НаКлиенте
//Процедура ЗарегистрированВОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	//Если НЕ ПроверитьВыбранноеЗначениеЗарегистрирован(ВыбранноеЗначение,ОсновнаяОрганизация) Тогда
	//	СтандартнаяОбработка = Ложь;
	//	Запись.ЗарегистрированВ = Неопределено;
	//	Текст = "Выбранное охотхозяйство не принадлежит нашему региону";
	//	Поле = "Запись.ЗарегистрированВ";
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,Запись.ИсходныйКлючЗаписи,Поле);
	//КонецЕсли;	
//КонецПроцедуры

//&НаСервереБезКонтекста
//Функция ПроверитьВыбранноеЗначениеЗарегистрирован(Зарегистрирован,ОсновнаяОрганизация)
//	
//	Если ОсновнаяОрганизация.ЭтоГоловноеПредприятие Тогда
//		РегиональнаяОрганизация = Основнаяорганизация;
//		Возврат Истина;
//	Иначе
//		РегиональнаяОрганизация = Основнаяорганизация.РегиональнаяОрганизация;
//	КонецЕсли;	
//	
//	Если ТипЗнч(Зарегистрирован) = Тип("СправочникСсылка.ОрганыВыдачиГосБилетов") Тогда
//		Возврат Истина;
//	Иначе
//		Если Зарегистрирован.РегиональнаяОрганизация =  РегиональнаяОрганизация Тогда
//			Возврат Истина;
//		Иначе
//			Возврат Ложь;
//		КонецЕсли;	
//	КонецЕсли;	
//КонецФункции	

//&НаСервереБезКонтекста
//Функция ПолучитьСубъектГоловногоПредприятия()
//	Возврат Константы.ГоловноеПредприятие.Получить().СубъектРФ;	
//КонецФункции	

//&НаКлиенте
//Процедура ЗарегистрированВНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	Если НЕ ЭтоГосБилет Тогда
//		//СубъектРФ = ПолучитьСубъектГоловногоПредприятия();
//		//Если НЕ СубъектРФ.Пустая() Тогда
//		//	НовыйПараметр = Новый ПараметрВыбора("Отбор.СубъектРФ",СубъектРФ);
//		//	НовыйМассив = Новый Массив(1);
//		//	НовыйМассив[0] = НовыйПараметр;
//		//	НовыеПараметрыВыбора = Новый ФиксированныйМассив(НовыйМассив);
//		//	
//		//	Элемент.ПараметрыВыбора = НовыеПараметрыВыбора;  
//	//КонецЕсли;

//		
//			КонецЕсли;	
//КонецПроцедуры


//&НаКлиенте
//Процедура ЗарегистрированВИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
//	а=0;
//КонецПроцедуры
